// js/questions.js
export const QUESTIONS = [
  {
    q: "Какой породы кот у молодоженов?",
    a: ["Рэгдолл", "Сфинкс", "Бенгал", "Мейн-кун"],
    correct: 3
  },
  {
    q: "Сколько комнатных растений у молодоженов дома?",
    a: ["0 - 50", "51 - 100", "101 - 150", "151 - 200"],
    correct: 2
  },
  {
    q: "Молодожёны часто приглашают друзей и родственников в гости на шашлык. Сколько раз за 2 года совместной жизни они приготовили шашлык для себя?",
    a: ["0-3", "5-10", "15-25", "50+"],
    correct: 0
  },
  {
    q: "Кто из молодожёнов чаще всего косит траву на участке?",
    a: ["Надежда", "Владимир", "Одинаково", "Вызывают специалиста"],
    correct: 0
  },
  {
    q: "Какой ритуал у кота молодоженов перед сном?",
    a: ["Смотрит в окно как сосед гоняет куриц", "Демонстративно уходит спать на 1 этаж", "Ужинает листьями комнатных цветов", "Кусает пальцы на руках хозяев"],
    correct: 3
  },
  {
    q: "У молодожёнов есть беговая дорожка, виброплатформа, турник и степпер. Как часто они тренируются?",
    a: ["1-3 раза в неделю", "1-3 раза в месяц", "1-3 раза в полгода", "сидят и смотрят на тренажёры, поедая сладкое"],
    correct: 1
  },
  {
    q: "Как молодожёны праздновали новый 2026 год?",
    a: ["Вдвоем + кот", "На даче у друзей", "Вместе с родителями", "Летали заграницу"],
    correct: 0
  }
];
